Repository: kubernetes/kubernetes
Catalog: staging/src/k8s.io/kubectl/pkg/util/i18n/translations/kubectl/*/LC_MESSAGES/k8s.po
Languages: pt_br, zh_cn

source: # Show metrics for all nodes kubectl top node # Show metrics for a given node kubectl top node NODE_NAME
pt_br: # Mostra as métricas para todos os nodes kubectl top node # Mostra as métricas para um node específico kubectl top node NODE_NAME
zh_cn: # 显示所有节点的指标 kubectl top node # 显示指定节点的指标 kubectl top node NODE_NAME

source: # Get the documentation of the resource and its fields kubectl explain pods # Get the documentation of a specific field of a resource kubectl explain pods.spec.containers
pt_br: # Mostra a documentação do recurso e seus campos kubectl explain pods # Mostra a documentação de um campo específico de um recurso kubectl explain pods.spec.containers
zh_cn: # 获取资源及其字段的文档 kubectl explain pods # 获取资源指定字段的文档 kubectl explain pods.spec.containers

source: # Print flags inherited by all commands kubectl options
pt_br: # Mostra as opções herdadas por todos os comandos kubectl options
zh_cn: # 输出所有命令继承的 flags kubectl options

source: # Print the client and server versions for the current context kubectl version
pt_br: # Imprime a versão do cliente e do servidor para o contexto atual kubectl version
zh_cn: # 输出当前客户端和服务端的版本 kubectl version

source: # Print the supported API versions kubectl api-versions
pt_br: # Mostra as versões de API suportadas kubectl api-versions
zh_cn: # 输出支持的 API 版本 kubectl api-versions

source: # Show metrics for all pods in the default namespace kubectl top pod # Show metrics for all pods in the given namespace kubectl top pod --namespace=NAMESPACE # Show metrics for a given pod and its containers kubectl top pod POD_NAME --containers # Show metrics for the pods defined by label name=myLabel kubectl top pod -l name=myLabel
pt_br: # Mostra as métricas para todos os pods no namespace default kubectl top pod # Mostra as métricas para todos os pods em um dado namespace kubectl top pod —namespace=NAMESPACE # Mostra as métricas para um dado pod e seus containers kubectl top pod POD_NAME —containers # Mostra as métricas para os pods definidos pelo label name=myLabel kubectl top pod -l name=myLabel
zh_cn: # 显示 default 命名空间下所有 Pods 的指标 kubectl top pod # 显示指定命名空间下所有 Pods 的指标 kubectl top pod --namespace=NAMESPACE # 显示指定 Pod 和它的容器的 metrics kubectl top pod POD_NAME --containers # 显示指定 label 为 name=myLabel 的 Pods 的 metrics kubectl top pod -l name=myLabel

source: Convert config files between different API versions. Both YAML and JSON formats are accepted. The command takes filename, directory, or URL as input, and convert it into format of version specified by --output-version flag. If target version is not specified or not supported, convert to latest version. The default output will be printed to stdout in YAML format. One can use -o option to change to output destination.
pt_br: Convert os arquivos de configuração para diferentes versões de API. Ambos formatos YAML \e JSON são aceitos. O command recebe o nome do arquivo, diretório ou URL como entrada, e converteno formato para a versão especificada pelo parametro —output-version. Se a versão desejada não é especificada ou não é suportada, converte para a última versã disponível. A saída padrão é no formato YAML. Pode ser utilizadoa opção -o para mudar o formato de saída.
zh_cn: 在不同的 API 版本之间转换配置文件。接受 YAML 和 JSON 格式。 这个命令以文件名, 目录, 或者 URL 作为输入，并通过 —output-version 参数 转换到指定版本的格式。如果没有指定目标版本或者所指定版本 不支持, 则转换为最新版本。 默认以 YAML 格式输出到标准输出。可以使用 -o option 修改目标输出的格式。

source: Create a namespace with the specified name.
pt_br: Cria um namespace com um nome especificado.
zh_cn: 用给定名称创建一个命名空间。

source: Create a role with single rule.
pt_br: Cria uma role com uma única regra.
zh_cn: 创建一个具有单一规则的角色。

source: Create a service account with the specified name.
pt_br: Cria uma conta de serviço com um nome especificado.
zh_cn: 用指定的名称创建一个服务账户。

source: Mark node as schedulable.
pt_br: Remove a restrição de execução de workloads no node.
zh_cn: 标记节点为可调度。

source: Mark node as unschedulable.
pt_br: Aplica a restrição de execução de workloads no node.
zh_cn: 标记节点为不可调度。

source: Set the latest last-applied-configuration annotations by setting it to match the contents of a file. This results in the last-applied-configuration being updated as though 'kubectl apply -f <file>' was run, without updating any other parts of the object.
pt_br: Define a annotation last-applied-configuration configurando para ser igual ao conteúdo do arquivo. Isto resulta no last-applied-configuration ser atualizado quando o 'kubectl apply -f <file>' executa, não atualizando as outras partes do objeto.
zh_cn: 设置最新的 last-applied-configuration 注解，使之匹配某文件的内容。 这会导致 last-applied-configuration 被更新，就像执行了 kubectl apply -f <file> 一样， 只是不会更新对象的其他部分。

source: # Create a new namespace named my-namespace kubectl create namespace my-namespace
pt_br: # Cria um novo namespace chamado my-namespace kubectl create namespace my-namespace
zh_cn: # 创建一个名为 my-namespace 的新命名空间 kubectl create namespace my-namespace

source: # Create a new service account named my-service-account kubectl create serviceaccount my-service-account
pt_br: # Cria um novo service account chamado my-service-account kubectl create serviceaccount my-service-account
zh_cn: # 创建一个名为 my-service-account 的新服务帐户 kubectl create serviceaccount my-service-account

source: Create an ExternalName service with the specified name. ExternalName service references to an external DNS address instead of only pods, which will allow application authors to reference services that exist off platform, on other clusters, or locally.
pt_br: Cria um serviço do tipo ExternalName com o nome especificado. Serviço ExternalName referencia um endereço externo de DNS ao invés de apenas pods, o que permite aos desenvolvedores de aplicações referenciar serviços que existem fora da plataforma, em outros clusters ou localmente.
zh_cn: 创建具有指定名称的 ExternalName 服务。 ExternalName 服务引用外部 DNS 地址而不是 Pod 地址， 这将允许应用程序作者引用存在于平台外、其他集群上或本地的服务。

source: Help provides help for any command in the application. Simply type kubectl help [path to command] for full details.
pt_br: Help provê ajuda para qualquer comando na aplicação. Digite simplesmente kubectl help [caminho do comando] para detalhes completos.
zh_cn: Help 为应用程序中的任何命令提供帮助。 只需键入 kubectl help [命令路径] 即可获得完整的详细信息。

source: # Create a new LoadBalancer service named my-lbs kubectl create service loadbalancer my-lbs --tcp=5678:8080
pt_br: # Cria um novo serviço do tipo LoadBalancer chamado my-lbs kubectl create service loadbalancer my-lbs —tcp=5678:8080
zh_cn: # 创建一个名称为 my-lbs 的新负载均衡服务 kubectl create service loadbalancer my-lbs --tcp=5678:8080

source: # Dump current cluster state to stdout kubectl cluster-info dump # Dump current cluster state to /path/to/cluster-state kubectl cluster-info dump --output-directory=/path/to/cluster-state # Dump all namespaces to stdout kubectl cluster-info dump --all-namespaces # Dump a set of namespaces to /path/to/cluster-state kubectl cluster-info dump --namespaces default,kube-system --output-directory=/path/to/cluster-state
pt_br: # Coleta o estado corrente do cluster e exibe no stdout kubectl cluster-info dump # Coleta o estado corrente do custer para /path/to/cluster-state kubectl cluster-info dump --output-directory=/path/to/cluster-state # Coleta informação de todos os namespaces para stdout kubectl cluster-info dump --all-namespaces # Coleta o conjunto especificado de namespaces para /path/to/cluster-state kubectl cluster-info dump --namespaces default,kube-system --output-directory=/path/to/cluster-state
zh_cn: # 导出当前的集群状态信息到标准输出 kubectl cluster-info dump # 导出当前的集群状态到 /path/to/cluster-state kubectl cluster-info dump --output-directory=/path/to/cluster-state # 导出所有命名空间到标准输出 kubectl cluster-info dump --all-namespaces # 导出一组命名空间到 /path/to/cluster-state kubectl cluster-info dump --namespaces default,kube-system --output-directory=/path/to/cluster-state

source: Create a LoadBalancer service with the specified name.
pt_br: Cria um serviço do tipo LoadBalancer com o nome especificado.
zh_cn: 使用一个指定的名称创建一个 LoadBalancer 服务。

source: A comma-delimited set of quota scopes that must all match each object tracked by the quota.
pt_br: Lista de valores delimitados por vírgulas para um conjunto de escopos de quota que devem corresponder para cada objeto rastreado pela quota.
zh_cn: 一组以逗号分隔的配额范围，必须全部匹配配额所跟踪的每个对象。

source: A comma-delimited set of resource=quantity pairs that define a hard limit.
pt_br: Lista de valores delimitados por vírgulas ajusta os pares resource=quantity que define um limite rigído.
zh_cn: 一组以逗号分隔的资源=数量对，用于定义硬性限制。

source: A label selector to use for this budget. Only equality-based selector requirements are supported.
pt_br: Um seletor de label a ser usado para o PDB. Apenas seletores baseado em igualdade são suportados.
zh_cn: 一个用于该预算的标签选择器。只支持基于等值比较的选择器要求。

source: A label selector to use for this service. Only equality-based selector requirements are supported. If empty (the default) infer the selector from the replication controller or replica set.)
pt_br: Um seletor de label para ser utilizado neste serviço. Apenas seletores baseado em igualdade são suportados. Se vazio (por padrão) o seletor do replication controller ou replica set será utilizado.
zh_cn: 用于此服务的标签选择器。仅支持基于等值比较的选择器要求。如果为空（默认），则从副本控制器或副本集中推断选择器。）

source: Additional external IP address (not managed by Kubernetes) to accept for the service. If this IP is routed to a node, the service can be accessed by this IP in addition to its generated service IP.
pt_br: Um IP externo adicional (não gerenciado pelo Kubernetes) para ser usado no serviço. Se este IP for roteado para um nó, o serviço pode ser acessado por este IP além de seu IP de serviço gerado.
zh_cn: 为服务所接受的其他外部 IP 地址（不由 Kubernetes 管理）。如果这个 IP 被路由到一个节点，除了其生成的服务 IP 外，还可以通过这个 IP 访问服务。

source: An inline JSON override for the generated object. If this is non-empty, it is used to override the generated object. Requires that the object supply a valid apiVersion field.
pt_br: Uma substituição inline JSON para o objeto gerado. Se não estiver vazio, ele será usado para substituir o objeto gerado. Requer que o objeto forneça um campo apiVersion válido.
zh_cn: 针对所生成对象的内联 JSON 覆盖。如果这一对象是非空的，将用于覆盖所生成的对象。要求对象提供有效的 apiVersion 字段。

source: Approve a certificate signing request
pt_br: Aprova uma solicitação de assinatura de certificado
zh_cn: 批准一个证书签署请求

source: Assign your own ClusterIP or set to 'None' for a 'headless' service (no loadbalancing).
pt_br: Atribuir o seu próprio ClusterIP ou configura para 'None' para um serviço 'headless' (sem loadbalancing).
zh_cn: 为“无头”服务（无负载平衡）分配你自己的 ClusterIP 或设置为“无。

source: Attach to a running container
pt_br: Se conecta a um container em execução
zh_cn: 挂接到一个运行中的容器

source: ClusterIP to be assigned to the service. Leave empty to auto-allocate, or set to 'None' to create a headless service.
pt_br: ClusterIP que será atribuído ao serviço. Deixe vazio para auto atribuição, ou configure para 'None' para criar um serviço headless.
zh_cn: 要分配给服务的 ClusterIP。留空表示自动分配，或设置为 “None” 以创建无头服务。

source: ClusterRole this ClusterRoleBinding should reference
pt_br: ClusterRole que esse ClusterRoleBinding deve referenciar
zh_cn: ClusterRoleBinding 应该指定 ClusterRole

source: ClusterRole this RoleBinding should reference
pt_br: ClusterRole que esse RoleBinding deve referenciar
zh_cn: RoleBinding 应该指定 ClusterRole

source: Convert config files between different API versions
pt_br: Converte arquivos de configuração entre versões de API diferentes
zh_cn: 在不同的 API 版本之间转换配置文件

source: Copy files and directories to and from containers.
pt_br: Copia arquivos e diretórios de e para containers.
zh_cn: 将文件和目录复制到容器中或从容器中复制出来。

source: Create a TLS secret
pt_br: Cria uma secret do tipo TLS
zh_cn: 创建一个 TLS secret

source: Create a namespace with the specified name
pt_br: Cria a namespace com um nome especificado
zh_cn: 用指定的名称创建一个命名空间

source: Create a secret for use with a Docker registry
pt_br: Cria um secret para ser utilizado com o Docker registry
zh_cn: 创建一个给 Docker registry 使用的 Secret

source: Create a secret using specified subcommand
pt_br: Cria um secret utilizando um sub-comando especificado
zh_cn: 使用指定的子命令创建一个 Secret

source: Create a service account with the specified name
pt_br: Cria uma conta de serviço com um nome especificado
zh_cn: 创建一个指定名称的服务账户

source: Delete the specified cluster from the kubeconfig
pt_br: Apaga o cluster especificado do kubeconfig
zh_cn: 从 kubeconfig 中删除指定的集群

source: Delete the specified context from the kubeconfig
pt_br: Apaga o contexto especificado do kubeconfig
zh_cn: 从 kubeconfig 中删除指定的上下文

source: Deny a certificate signing request
pt_br: Rejeita o pedido de assinatura do certificado
zh_cn: 拒绝一个证书签名请求

source: Describe one or many contexts
pt_br: Mostra um ou mais contextos
zh_cn: 描述一个或多个上下文

source: Display clusters defined in the kubeconfig
pt_br: Mostra os clusters definidos no kubeconfig
zh_cn: 显示在 kubeconfig 中定义的集群

source: Display merged kubeconfig settings or a specified kubeconfig file
pt_br: Mostra a configuração do kubeconfig mescladas ou um arquivo kubeconfig especificado
zh_cn: 显示合并的 kubeconfig 配置或一个指定的 kubeconfig 文件

source: Display one or many resources
pt_br: Mostra um ou mais recursos
zh_cn: 显示一个或多个资源

source: Drain node in preparation for maintenance
pt_br: Drenar o node para preparação de manutenção
zh_cn: 清空节点以准备维护

source: Edit a resource on the server
pt_br: Edita um recurso no servidor
zh_cn: 编辑服务器上的资源

source: Email for Docker registry
pt_br: Email para o Docker registry
zh_cn: 用于 Docker 镜像库的邮件地址

source: Execute a command in a container
pt_br: Executa um comando em um container
zh_cn: 在某个容器中执行一个命令

source: Forward one or more local ports to a pod
pt_br: Encaminhar uma ou mais portas locais para um pod
zh_cn: 将一个或多个本地端口转发到某个 Pod

source: Help about any command
pt_br: Ajuda sobre qualquer comando
zh_cn: 关于任何命令的帮助

source: If non-empty, set the session affinity for the service to this; legal values: 'None', 'ClientIP'
pt_br: Se não vazio, configura a afinidade de sessão para o serviço; valores válidos: 'None', 'ClientIP'
zh_cn: 如果非空，则将服务的会话亲和性设置为此值；合法值：'None'、'ClientIP'

source: If non-empty, the annotation update will only succeed if this is the current resource-version for the object. Only valid when specifying a single resource.
pt_br: Se não estiver vazio, a atualização dos annotation só terá êxito se esta for a versão do recurso atual para o objeto. Válido apenas ao especificar um único recurso.
zh_cn: 如果非空，则只有当所给值是对象的当前资源版本时，注解更新才会成功。 仅在指定单个资源时有效。

source: If non-empty, the labels update will only succeed if this is the current resource-version for the object. Only valid when specifying a single resource.
pt_br: Se não estiver vazio, a atualização dos labels só terá êxito se esta for a versão do recurso atual para o objeto. Válido apenas ao especificar um único recurso.
zh_cn: 如果非空，则标签更新只有在所给值是对象的当前资源版本时才会成功。仅在指定单个资源时有效。

source: Mark node as schedulable
pt_br: Marca o node como agendável
zh_cn: 标记节点为可调度

source: Mark node as unschedulable
pt_br: Marca o node como não agendável
zh_cn: 标记节点为不可调度

source: Mark the provided resource as paused
pt_br: Marca o recurso fornecido como pausado
zh_cn: 将所指定的资源标记为已暂停

source: Modify certificate resources.
pt_br: Edita o certificado dos recursos.
zh_cn: 修改证书资源。

source: Modify kubeconfig files
pt_br: Edita o arquivo kubeconfig
zh_cn: 修改 kubeconfig 文件

source: Name or number for the port on the container that the service should direct traffic to. Optional.
pt_br: Nome ou o número da porta em um container em que o serviço deve direcionar o tráfego. Opcional.
zh_cn: 此为端口的名称或端口号，服务应将流量定向到容器上的这一端口。此属性为可选。

source: Only return logs after a specific date (RFC3339). Defaults to all logs. Only one of since-time / since may be used.
pt_br: Apenas retorna os logs após uma data específica (RFC3339). Padrão para todos os logs. Apenas um since-time / since deve ser utilizado.
zh_cn: 仅返回在指定日期 (RFC3339) 之后的日志。默认为所有日志。只能使用 since-time / since 之一。

source: Output shell completion code for the specified shell (bash or zsh)
pt_br: Saída do autocomplete de shell para um Shell específico (bash ou zsh)
zh_cn: 为指定的 Shell(Bash 或 zsh) 输出 Shell 补全代码。

source: Password for Docker registry authentication
pt_br: Senha para a autenticação do registro do Docker
zh_cn: 用于 Docker 镜像库身份验证的密码

source: Path to PEM encoded public key certificate.
pt_br: Caminho para a chave pública em formato PEM.
zh_cn: PEM 编码的公钥证书的路径。

source: Path to private key associated with given certificate.
pt_br: Caminho para a chave private associada a um certificado fornecido.
zh_cn: 与给定证书关联的私钥的路径。

source: Precondition for resource version. Requires that the current resource version match this value in order to scale.
pt_br: Pré-condição para a versão do recurso. Requer que a versão do recurso atual corresponda a este valor para escalar.
zh_cn: 资源版本的前提条件。要求当前资源版本与此值匹配才能进行扩缩操作。

source: Print the client and server version information
pt_br: Mostra a informação de versão do cliente e do servidor
zh_cn: 输出客户端和服务端的版本信息

source: Print the list of flags inherited by all commands
pt_br: Mostra a lista de opções herdadas por todos os comandos
zh_cn: 输出所有命令的层级关系

source: Print the logs for a container in a pod
pt_br: Mostra os logs de um container em um pod
zh_cn: 打印 Pod 中容器的日志

source: Resume a paused resource
pt_br: Retoma um recurso pausado
zh_cn: 恢复暂停的资源

source: Role this RoleBinding should reference
pt_br: Role que a RoleBinding deve referenciar
zh_cn: RoleBinding 应该引用的 Role

source: Run a particular image on the cluster
pt_br: Executa uma imagem específica no cluster
zh_cn: 在集群上运行特定镜像

source: Run a proxy to the Kubernetes API server
pt_br: Executa um proxy para o servidor de API do Kubernetes
zh_cn: 运行一个指向 Kubernetes API 服务器的代理

source: Server location for Docker registry
pt_br: Localização do servidor para o registro do Docker
zh_cn: Docker 镜像库的服务器位置

source: Set specific features on objects
pt_br: Define funcionalidades específicas em objetos
zh_cn: 为对象设置指定特性

source: Set the selector on a resource
pt_br: Define um seletor em um recurso
zh_cn: 为资源设置选择器

source: Show details of a specific resource or group of resources
pt_br: Mostra os detalhes de um recurso específico ou de um grupo de recursos
zh_cn: 显示特定资源或资源组的详细信息

source: Show the status of the rollout
pt_br: Mostra o status de uma atualização dinamica
zh_cn: 显示上线的状态

source: Synonym for --target-port
pt_br: Sinônimo para —target-port
zh_cn: --target-port 的同义词

source: The image for the container to run.
pt_br: A imagem para o container executar.
zh_cn: 指定容器要运行的镜像.

source: The image pull policy for the container. If left empty, this value will not be specified by the client and defaulted by the server
pt_br: A política de obtenção de imagens. Se deixado em branco, este valor não será especificado pelo cliente e será utilizado o padrão do servidor
zh_cn: 容器的镜像拉取策略。如果留空，该值将不由客户端指定，由服务器默认设置

source: The minimum number or percentage of available pods this budget requires.
pt_br: Um número mínimo ou porcentagem de pods disponíveis que este budget requer.
zh_cn: 此预算要求的可用 Pod 的最小数量或百分比。

source: The name for the newly created object.
pt_br: O nome para o objeto recém criado.
zh_cn: 新创建的对象的名称。

source: The name for the newly created object. If not specified, the name of the input resource will be used.
pt_br: O nome para o objeto recém criado. Se não especificado, o nome do input resource será utilizado.
zh_cn: 新创建的对象的名称。如果未指定，将使用输入资源的名称。

source: The name of the API generator to use. There are 2 generators: 'service/v1' and 'service/v2'. The only difference between them is that service port in v1 is named 'default', while it is left unnamed in v2. Default is 'service/v2'.
pt_br: O nome do gerador de API a ser usado. Existem 2 geradores: 'service/v1' e 'service/v2'. A única diferença entre eles é que a porta de serviço na v1 é chamada de 'default', enquanto ela é deixada sem nome na v2. O padrão é 'service/v2'.
zh_cn: 要使用的 API 生成器的名称。有两个生成器。'service/v1' 和 'service/v2'。它们之间唯一的区别是，v1 中的服务端口被命名为 'default'，如果在 v2 中没有指定名称。默认是 'service/v2'。

source: The network protocol for the service to be created. Default is 'TCP'.
pt_br: O protocolo de rede para o serviço ser criado. Padrão é 'TCP'.
zh_cn: 要创建的服务的网络协议。默认为 “TCP”。

source: The port that the service should serve on. Copied from the resource being exposed, if unspecified
pt_br: A porta para que o serviço possa servir. Copiado do recurso sendo exposto, se não especificado
zh_cn: 服务要使用的端口。如果没有指定，则从被暴露的资源复制

source: The resource requirement limits for this container. For example, 'cpu=200m,memory=512Mi'. Note that server side components may assign limits depending on the server configuration, such as limit ranges.
pt_br: O recurso requerido para este container. Por exemplo, 'cpu=200m,memory=512Mi'. Observe que os componentes do lado do servidor podem atribuir limites, dependendo da configuração do servidor, como intervalos de limite.
zh_cn: 这个容器的资源需求限制。例如，"cpu=200m,内存=512Mi"。请注意，服务器端的组件可能会根据服务器的配置来分配限制，例如限制范围。

source: The resource requirement requests for this container. For example, 'cpu=100m,memory=256Mi'. Note that server side components may assign requests depending on the server configuration, such as limit ranges.
pt_br: O recurso requerido de requests para este container. Por exemplo, 'cpu=100m,memory=256Mi'. Observe que os componentes do lado do servidor podem atribuir requests, dependendo da configuração do servidor, como intervalos de limite.
zh_cn: 这个容器的资源需求请求。例如，"cpu=200m,内存=512Mi"。请注意，服务器端的组件可能会根据服务器的配置来分配限制，例如限制范围。

source: The type of secret to create
pt_br: O tipo de segredo para criar
zh_cn: 要创建的 Secret 类型

source: Undo a previous rollout
pt_br: Desfazer o rollout anterior
zh_cn: 撤销上一次的上线

source: Update resource requests/limits on objects with pod templates
pt_br: Atualizar os recursos de request/limites em um objeto com template de pod
zh_cn: 使用 Pod 模板更新对象的资源请求/限制

source: Update the annotations on a resource
pt_br: Atualizar as anotações de um recurso
zh_cn: 更新一个资源的注解

source: Update the labels on a resource
pt_br: Atualizar os labels de um recurso
zh_cn: 更新某资源上的标签

source: Update the taints on one or more nodes
pt_br: Atualizar o taints de um ou mais nodes
zh_cn: 更新一个或者多个节点上的污点

source: Username for Docker registry authentication
pt_br: Nome de usuário para a autenticação no Docker registry
zh_cn: 用于 Docker 镜像库身份验证的用户名

source: View rollout history
pt_br: Visualizar o histórico de rollout
zh_cn: 显示上线历史

source: Where to output the files. If empty or '-' uses stdout, otherwise creates a directory hierarchy in that directory
pt_br: Onde colocar os arquivos de saída. Se vazio ou '-' usa o stdout do terminal, caso contrário, cria uma hierarquia no diretório configurado
zh_cn: 在哪里输出文件。如果为空或 “-” 则使用标准输出，否则在该目录中创建目录层次结构

source: dummy restart flag)
zh_cn: 假的重启标志)

source: kubectl controls the Kubernetes cluster manager
pt_br: kubectl controla o gerenciador de cluster do Kubernetes
zh_cn: kubectl 控制 Kubernetes 集群管理器
